MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS806/mcu.h
#define PTGQUE6 PTGQUE6
extern volatile uint16_t PTGQUE6 __attribute__((__sfr__));
typedef struct tagPTGQUE6BITS {
  uint16_t STEP12:8;
  uint16_t STEP13:8;
} PTGQUE6BITS;
extern volatile PTGQUE6BITS PTGQUE6bits __attribute__((__sfr__));

#define PTGQUE7 PTGQUE7
extern volatile uint16_t PTGQUE7 __attribute__((__sfr__));
typedef struct tagPTGQUE7BITS {
  uint16_t STEP14:8;
  uint16_t STEP15:8;
} PTGQUE7BITS;
extern volatile PTGQUE7BITS PTGQUE7bits __attribute__((__sfr__));

#define PTGQUE8 PTGQUE8
extern volatile uint16_t PTGQUE8 __attribute__((__sfr__));
typedef struct tagPTGQUE8BITS {
  uint16_t STEP16:8;
  uint16_t STEP17:8;
} PTGQUE8BITS;
extern volatile PTGQUE8BITS PTGQUE8bits __attribute__((__sfr__));

#define PTGQUE9 PTGQUE9
extern volatile uint16_t PTGQUE9 __attribute__((__sfr__));
typedef struct tagPTGQUE9BITS {
  uint16_t STEP18:8;
  uint16_t STEP19:8;
} PTGQUE9BITS;
extern volatile PTGQUE9BITS PTGQUE9bits __attribute__((__sfr__));

#define PTGQUE10 PTGQUE10
extern volatile uint16_t PTGQUE10 __attribute__((__sfr__));
typedef struct tagPTGQUE10BITS {
  uint16_t STEP20:8;
  uint16_t STEP21:8;
} PTGQUE10BITS;
extern volatile PTGQUE10BITS PTGQUE10bits __attribute__((__sfr__));

#define PTGQUE11 PTGQUE11
extern volatile uint16_t PTGQUE11 __attribute__((__sfr__));
typedef struct tagPTGQUE11BITS {
  uint16_t STEP22:8;
  uint16_t STEP23:8;
} PTGQUE11BITS;
extern volatile PTGQUE11BITS PTGQUE11bits __attribute__((__sfr__));

#define PTGQUE12 PTGQUE12
extern volatile uint16_t PTGQUE12 __attribute__((__sfr__));
typedef struct tagPTGQUE12BITS {
  uint16_t STEP24:8;
  uint16_t STEP25:8;
} PTGQUE12BITS;
extern volatile PTGQUE12BITS PTGQUE12bits __attribute__((__sfr__));

#define PTGQUE13 PTGQUE13
extern volatile uint16_t PTGQUE13 __attribute__((__sfr__));
typedef struct tagPTGQUE13BITS {
  uint16_t STEP26:8;
  uint16_t STEP27:8;
} PTGQUE13BITS;
extern volatile PTGQUE13BITS PTGQUE13bits __attribute__((__sfr__));

#define PTGQUE14 PTGQUE14
extern volatile uint16_t PTGQUE14 __attribute__((__sfr__));
typedef struct tagPTGQUE14BITS {
  uint16_t STEP28:8;
  uint16_t STEP29:8;
} PTGQUE14BITS;
extern volatile PTGQUE14BITS PTGQUE14bits __attribute__((__sfr__));

#define PTGQUE15 PTGQUE15
extern volatile uint16_t PTGQUE15 __attribute__((__sfr__));
typedef struct tagPTGQUE15BITS {
  uint16_t STEP30:8;
  uint16_t STEP31:8;
} PTGQUE15BITS;
extern volatile PTGQUE15BITS PTGQUE15bits __attribute__((__sfr__));

#define DMA0CON DMA0CON
extern volatile uint16_t DMA0CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA0CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA0CONBITS;
extern volatile DMA0CONBITS DMA0CONbits __attribute__((__sfr__));

#define DMA0REQ DMA0REQ
extern volatile uint16_t DMA0REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA0REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA0REQBITS;
extern volatile DMA0REQBITS DMA0REQbits __attribute__((__sfr__));

#define DMA0STAL DMA0STAL
extern volatile uint16_t DMA0STAL __attribute__((__sfr__));
#define DMA0STAH DMA0STAH
extern volatile uint16_t DMA0STAH __attribute__((__sfr__));
typedef struct tagDMA0STAHBITS {
  uint16_t STA:8;
} DMA0STAHBITS;
extern volatile DMA0STAHBITS DMA0STAHbits __attribute__((__sfr__));

#define DMA0STBL DMA0STBL
extern volatile uint16_t DMA0STBL __attribute__((__sfr__));
#define DMA0STBH DMA0STBH
extern volatile uint16_t DMA0STBH __attribute__((__sfr__));
typedef struct tagDMA0STBHBITS {
  uint16_t STB:8;
} DMA0STBHBITS;
extern volatile DMA0STBHBITS DMA0STBHbits __attribute__((__sfr__));

#define DMA0PAD DMA0PAD
extern volatile uint16_t DMA0PAD __attribute__((__sfr__));
#define DMA0CNT DMA0CNT
extern volatile uint16_t DMA0CNT __attribute__((__sfr__));
typedef struct tagDMA0CNTBITS {
  uint16_t CNT:14;
} DMA0CNTBITS;
extern volatile DMA0CNTBITS DMA0CNTbits __attribute__((__sfr__));

#define DMA1CON DMA1CON
extern volatile uint16_t DMA1CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA1CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA1CONBITS;
extern volatile DMA1CONBITS DMA1CONbits __attribute__((__sfr__));

#define DMA1REQ DMA1REQ
extern volatile uint16_t DMA1REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA1REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA1REQBITS;
extern volatile DMA1REQBITS DMA1REQbits __attribute__((__sfr__));

#define DMA1STAL DMA1STAL
extern volatile uint16_t DMA1STAL __attribute__((__sfr__));
#define DMA1STAH DMA1STAH
extern volatile uint16_t DMA1STAH __attribute__((__sfr__));
typedef struct tagDMA1STAHBITS {
  uint16_t STA:8;
} DMA1STAHBITS;
extern volatile DMA1STAHBITS DMA1STAHbits __attribute__((__sfr__));

#define DMA1STBL DMA1STBL
extern volatile uint16_t DMA1STBL __attribute__((__sfr__));
#define DMA1STBH DMA1STBH
extern volatile uint16_t DMA1STBH __attribute__((__sfr__));
typedef struct tagDMA1STBHBITS {
  uint16_t STB:8;
} DMA1STBHBITS;
extern volatile DMA1STBHBITS DMA1STBHbits __attribute__((__sfr__));

