MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS806/mcu.h
/* IFS11 */
#define _ADCMP0IF IFS11bits.ADCMP0IF
#define _ADCMP1IF IFS11bits.ADCMP1IF
#define _ADFLTR0IF IFS11bits.ADFLTR0IF
#define _ADFLTR1IF IFS11bits.ADFLTR1IF
#define _ADCC0EIF IFS11bits.ADCC0EIF
#define _ADCC1EIF IFS11bits.ADCC1EIF
#define _ADCC2EIF IFS11bits.ADCC2EIF
#define _ADCC3EIF IFS11bits.ADCC3EIF

/* IEC0 */
#define _INT0IE IEC0bits.INT0IE
#define _IC1IE IEC0bits.IC1IE
#define _OC1IE IEC0bits.OC1IE
#define _T1IE IEC0bits.T1IE
#define _DMA0IE IEC0bits.DMA0IE
#define _IC2IE IEC0bits.IC2IE
#define _OC2IE IEC0bits.OC2IE
#define _T2IE IEC0bits.T2IE
#define _T3IE IEC0bits.T3IE
#define _SPI1TXIE IEC0bits.SPI1TXIE
#define _SPI1RXIE IEC0bits.SPI1RXIE
#define _U1RXIE IEC0bits.U1RXIE
#define _U1TXIE IEC0bits.U1TXIE
#define _ADCIE IEC0bits.ADCIE
#define _DMA1IE IEC0bits.DMA1IE
#define _NVMIE IEC0bits.NVMIE

/* IEC1 */
#define _SI2C1IE IEC1bits.SI2C1IE
#define _MI2C1IE IEC1bits.MI2C1IE
#define _AC1IE IEC1bits.AC1IE
#define _CNIE IEC1bits.CNIE
#define _INT1IE IEC1bits.INT1IE
#define _DMA2IE IEC1bits.DMA2IE
#define _OC3IE IEC1bits.OC3IE
#define _OC4IE IEC1bits.OC4IE
#define _T4IE IEC1bits.T4IE
#define _T5IE IEC1bits.T5IE
#define _INT2IE IEC1bits.INT2IE
#define _U2RXIE IEC1bits.U2RXIE
#define _U2TXIE IEC1bits.U2TXIE

/* IEC2 */
#define _SPI2TXIE IEC2bits.SPI2TXIE
#define _SPI2RXIE IEC2bits.SPI2RXIE
#define _C1RXIE IEC2bits.C1RXIE
#define _C1IE IEC2bits.C1IE
#define _DMA3IE IEC2bits.DMA3IE
#define _IC3IE IEC2bits.IC3IE
#define _IC4IE IEC2bits.IC4IE

/* IEC3 */
#define _SI2C2IE IEC3bits.SI2C2IE
#define _MI2C2IE IEC3bits.MI2C2IE
#define _INT4IE IEC3bits.INT4IE
#define _C2RXIE IEC3bits.C2RXIE
#define _C2IE IEC3bits.C2IE
#define _PSEMIE IEC3bits.PSEMIE

/* IEC4 */
#define _U1EIE IEC4bits.U1EIE
#define _U2EIE IEC4bits.U2EIE
#define _C1TXIE IEC4bits.C1TXIE
#define _C2TXIE IEC4bits.C2TXIE
#define _PSESIE IEC4bits.PSESIE

/* IEC5 */
#define _SPI3TXIE IEC5bits.SPI3TXIE
#define _SPI3RXIE IEC5bits.SPI3RXIE
#define _PWM1IE IEC5bits.PWM1IE
#define _PWM2IE IEC5bits.PWM2IE

/* IEC6 */
#define _PWM3IE IEC6bits.PWM3IE
#define _PWM4IE IEC6bits.PWM4IE
#define _PWM5IE IEC6bits.PWM5IE
#define _PWM6IE IEC6bits.PWM6IE
#define _PWM7IE IEC6bits.PWM7IE
#define _PWM8IE IEC6bits.PWM8IE
#define _AC2IE IEC6bits.AC2IE
#define _AC3IE IEC6bits.AC3IE
#define _AC4IE IEC6bits.AC4IE
#define _ADCAN0IE IEC6bits.ADCAN0IE
#define _ADCAN1IE IEC6bits.ADCAN1IE

/* IEC7 */
#define _ADCAN2IE IEC7bits.ADCAN2IE
#define _ADCAN3IE IEC7bits.ADCAN3IE
#define _ADCAN4IE IEC7bits.ADCAN4IE
#define _ADCAN5IE IEC7bits.ADCAN5IE
#define _ADCAN6IE IEC7bits.ADCAN6IE
#define _ADCAN7IE IEC7bits.ADCAN7IE
#define _SPI1EIE IEC7bits.SPI1EIE
#define _SPI2EIE IEC7bits.SPI2EIE
#define _SPI3EIE IEC7bits.SPI3EIE

/* IEC8 */
#define _CLC1IE IEC8bits.CLC1IE
#define _CLC2IE IEC8bits.CLC2IE
#define _CLC3IE IEC8bits.CLC3IE
#define _CLC4IE IEC8bits.CLC4IE
/* Bitname _ICDIF cannot be defined because it is used by more than one SFR */
#define _JTAGIE IEC8bits.JTAGIE

/* IEC9 */
#define _PTGSTEPIE IEC9bits.PTGSTEPIE
#define _PTGWDTIE IEC9bits.PTGWDTIE
#define _PTG0IE IEC9bits.PTG0IE
#define _PTG1IE IEC9bits.PTG1IE
#define _PTG2IE IEC9bits.PTG2IE
#define _PTG3IE IEC9bits.PTG3IE
#define _ADCAN8IE IEC9bits.ADCAN8IE
#define _ADCAN9IE IEC9bits.ADCAN9IE
#define _ADCAN10IE IEC9bits.ADCAN10IE
#define _ADCAN11IE IEC9bits.ADCAN11IE
#define _ADCAN12IE IEC9bits.ADCAN12IE
#define _ADCAN13IE IEC9bits.ADCAN13IE
#define _ADCAN14IE IEC9bits.ADCAN14IE
#define _ADCAN15IE IEC9bits.ADCAN15IE
#define _ADCAN16IE IEC9bits.ADCAN16IE

/* IEC10 */
#define _ADCAN17IE IEC10bits.ADCAN17IE
#define _ADCAN18IE IEC10bits.ADCAN18IE
#define _ADCAN19IE IEC10bits.ADCAN19IE
#define _ADCAN20IE IEC10bits.ADCAN20IE
#define _ADCAN21IE IEC10bits.ADCAN21IE
#define _I2C1BCIE IEC10bits.I2C1BCIE
#define _I2C2BCIE IEC10bits.I2C2BCIE

/* IEC11 */
#define _ADCMP0IE IEC11bits.ADCMP0IE
#define _ADCMP1IE IEC11bits.ADCMP1IE
#define _ADFLTR0IE IEC11bits.ADFLTR0IE
#define _ADFLTR1IE IEC11bits.ADFLTR1IE
#define _ADCC0EIE IEC11bits.ADCC0EIE
#define _ADCC1EIE IEC11bits.ADCC1EIE
#define _ADCC2EIE IEC11bits.ADCC2EIE
#define _ADCC3EIE IEC11bits.ADCC3EIE

/* IPC0 */
#define _INT0IP IPC0bits.INT0IP
#define _IC1IP IPC0bits.IC1IP
#define _OC1IP IPC0bits.OC1IP
#define _T1IP IPC0bits.T1IP
#define _INT0IP0 IPC0bits.INT0IP0
#define _INT0IP1 IPC0bits.INT0IP1
#define _INT0IP2 IPC0bits.INT0IP2
#define _IC1IP0 IPC0bits.IC1IP0
#define _IC1IP1 IPC0bits.IC1IP1
#define _IC1IP2 IPC0bits.IC1IP2
#define _OC1IP0 IPC0bits.OC1IP0
#define _OC1IP1 IPC0bits.OC1IP1
#define _OC1IP2 IPC0bits.OC1IP2
#define _T1IP0 IPC0bits.T1IP0
#define _T1IP1 IPC0bits.T1IP1
#define _T1IP2 IPC0bits.T1IP2

/* IPC1 */
#define _DMA0IP IPC1bits.DMA0IP
#define _IC2IP IPC1bits.IC2IP
#define _OC2IP IPC1bits.OC2IP
#define _T2IP IPC1bits.T2IP
#define _DMA0P0 IPC1bits.DMA0P0
#define _DMA0P1 IPC1bits.DMA0P1
#define _DMA0P2 IPC1bits.DMA0P2
#define _IC2IP0 IPC1bits.IC2IP0
#define _IC2IP1 IPC1bits.IC2IP1
#define _IC2IP2 IPC1bits.IC2IP2
#define _OC2IP0 IPC1bits.OC2IP0
#define _OC2IP1 IPC1bits.OC2IP1
#define _OC2IP2 IPC1bits.OC2IP2
#define _T2IP0 IPC1bits.T2IP0
#define _T2IP1 IPC1bits.T2IP1
#define _T2IP2 IPC1bits.T2IP2

/* IPC2 */
#define _T3IP IPC2bits.T3IP
#define _SPI1TXIP IPC2bits.SPI1TXIP
#define _SPI1RXIP IPC2bits.SPI1RXIP
#define _U1RXIP IPC2bits.U1RXIP
#define _T3IP0 IPC2bits.T3IP0
#define _T3IP1 IPC2bits.T3IP1
#define _T3IP2 IPC2bits.T3IP2
#define _SPI1TXIP0 IPC2bits.SPI1TXIP0
#define _SPI1TXIP1 IPC2bits.SPI1TXIP1
#define _SPI1TXIP2 IPC2bits.SPI1TXIP2
#define _SPI1RXIP0 IPC2bits.SPI1RXIP0
#define _SPI1RXIP1 IPC2bits.SPI1RXIP1
#define _SPI1RXIP2 IPC2bits.SPI1RXIP2
#define _U1RXIP0 IPC2bits.U1RXIP0
#define _U1RXIP1 IPC2bits.U1RXIP1
#define _U1RXIP2 IPC2bits.U1RXIP2

/* IPC3 */
#define _U1TXIP IPC3bits.U1TXIP
#define _ADCIP IPC3bits.ADCIP
#define _DMA1IP IPC3bits.DMA1IP
#define _NVMIP IPC3bits.NVMIP
#define _U1TXIP0 IPC3bits.U1TXIP0
#define _U1TXIP1 IPC3bits.U1TXIP1
#define _U1TXIP2 IPC3bits.U1TXIP2
#define _ADCIP0 IPC3bits.ADCIP0
#define _ADCIP1 IPC3bits.ADCIP1
#define _ADCIP2 IPC3bits.ADCIP2
#define _DMA1P0 IPC3bits.DMA1P0
#define _DMA1P1 IPC3bits.DMA1P1
#define _DMA1P2 IPC3bits.DMA1P2
#define _NVMIP0 IPC3bits.NVMIP0
#define _NVMIP1 IPC3bits.NVMIP1
#define _NVMIP2 IPC3bits.NVMIP2

/* IPC4 */
#define _SI2C1IP IPC4bits.SI2C1IP
#define _MI2C1IP IPC4bits.MI2C1IP
#define _AC1IP IPC4bits.AC1IP
#define _CNIP IPC4bits.CNIP
#define _SI2C1IP0 IPC4bits.SI2C1IP0
#define _SI2C1IP1 IPC4bits.SI2C1IP1
#define _SI2C1IP2 IPC4bits.SI2C1IP2
#define _MI2C1IP0 IPC4bits.MI2C1IP0
#define _MI2C1IP1 IPC4bits.MI2C1IP1
#define _MI2C1IP2 IPC4bits.MI2C1IP2
#define _AC1IP0 IPC4bits.AC1IP0
#define _AC1IP1 IPC4bits.AC1IP1
#define _AC1IP2 IPC4bits.AC1IP2
#define _CNIP0 IPC4bits.CNIP0
#define _CNIP1 IPC4bits.CNIP1
#define _CNIP2 IPC4bits.CNIP2
#define _CMP1IP IPC4bits.CMP1IP
#define _CMP1IP0 IPC4bits.CMP1IP0
#define _CMP1IP1 IPC4bits.CMP1IP1
#define _CMP1IP2 IPC4bits.CMP1IP2

/* IPC5 */
#define _INT1IP IPC5bits.INT1IP
#define _INT1IP0 IPC5bits.INT1IP0
#define _INT1IP1 IPC5bits.INT1IP1
#define _INT1IP2 IPC5bits.INT1IP2

