MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS806/mcu.h
#define _SPI1CON3_WLENGTH_POSITION               0x00000000
#define _SPI1CON3_WLENGTH_MASK                   0x0000001F
#define _SPI1CON3_WLENGTH_LENGTH                 0x00000005

#define _SPI1STATL_SPIRBF_POSITION               0x00000000
#define _SPI1STATL_SPIRBF_MASK                   0x00000001
#define _SPI1STATL_SPIRBF_LENGTH                 0x00000001

#define _SPI1STATL_SPITBF_POSITION               0x00000001
#define _SPI1STATL_SPITBF_MASK                   0x00000002
#define _SPI1STATL_SPITBF_LENGTH                 0x00000001

#define _SPI1STATL_SPITBE_POSITION               0x00000003
#define _SPI1STATL_SPITBE_MASK                   0x00000008
#define _SPI1STATL_SPITBE_LENGTH                 0x00000001

#define _SPI1STATL_SPIRBE_POSITION               0x00000005
#define _SPI1STATL_SPIRBE_MASK                   0x00000020
#define _SPI1STATL_SPIRBE_LENGTH                 0x00000001

#define _SPI1STATL_SPIROV_POSITION               0x00000006
#define _SPI1STATL_SPIROV_MASK                   0x00000040
#define _SPI1STATL_SPIROV_LENGTH                 0x00000001

#define _SPI1STATL_SRMT_POSITION                 0x00000007
#define _SPI1STATL_SRMT_MASK                     0x00000080
#define _SPI1STATL_SRMT_LENGTH                   0x00000001

#define _SPI1STATL_SPITUR_POSITION               0x00000008
#define _SPI1STATL_SPITUR_MASK                   0x00000100
#define _SPI1STATL_SPITUR_LENGTH                 0x00000001

#define _SPI1STATL_SPIBUSY_POSITION              0x0000000B
#define _SPI1STATL_SPIBUSY_MASK                  0x00000800
#define _SPI1STATL_SPIBUSY_LENGTH                0x00000001

#define _SPI1STATL_FRMERR_POSITION               0x0000000C
#define _SPI1STATL_FRMERR_MASK                   0x00001000
#define _SPI1STATL_FRMERR_LENGTH                 0x00000001

#define _SPI1STATH_TXELM_POSITION                0x00000000
#define _SPI1STATH_TXELM_MASK                    0x0000003F
#define _SPI1STATH_TXELM_LENGTH                  0x00000006

#define _SPI1STATH_RXELM_POSITION                0x00000008
#define _SPI1STATH_RXELM_MASK                    0x00003F00
#define _SPI1STATH_RXELM_LENGTH                  0x00000006

#define _SPI1STATH_TXELM0_POSITION               0x00000000
#define _SPI1STATH_TXELM0_MASK                   0x00000001
#define _SPI1STATH_TXELM0_LENGTH                 0x00000001

#define _SPI1STATH_TXELM1_POSITION               0x00000001
#define _SPI1STATH_TXELM1_MASK                   0x00000002
#define _SPI1STATH_TXELM1_LENGTH                 0x00000001

#define _SPI1STATH_TXELM2_POSITION               0x00000002
#define _SPI1STATH_TXELM2_MASK                   0x00000004
#define _SPI1STATH_TXELM2_LENGTH                 0x00000001

#define _SPI1STATH_TXELM3_POSITION               0x00000003
#define _SPI1STATH_TXELM3_MASK                   0x00000008
#define _SPI1STATH_TXELM3_LENGTH                 0x00000001

#define _SPI1STATH_TXELM4_POSITION               0x00000004
#define _SPI1STATH_TXELM4_MASK                   0x00000010
#define _SPI1STATH_TXELM4_LENGTH                 0x00000001

#define _SPI1STATH_TXELM5_POSITION               0x00000005
#define _SPI1STATH_TXELM5_MASK                   0x00000020
#define _SPI1STATH_TXELM5_LENGTH                 0x00000001

#define _SPI1STATH_RXELM0_POSITION               0x00000008
#define _SPI1STATH_RXELM0_MASK                   0x00000100
#define _SPI1STATH_RXELM0_LENGTH                 0x00000001

#define _SPI1STATH_RXELM1_POSITION               0x00000009
#define _SPI1STATH_RXELM1_MASK                   0x00000200
#define _SPI1STATH_RXELM1_LENGTH                 0x00000001

#define _SPI1STATH_RXELM2_POSITION               0x0000000A
#define _SPI1STATH_RXELM2_MASK                   0x00000400
#define _SPI1STATH_RXELM2_LENGTH                 0x00000001

#define _SPI1STATH_RXELM3_POSITION               0x0000000B
#define _SPI1STATH_RXELM3_MASK                   0x00000800
#define _SPI1STATH_RXELM3_LENGTH                 0x00000001

#define _SPI1STATH_RXELM4_POSITION               0x0000000C
#define _SPI1STATH_RXELM4_MASK                   0x00001000
#define _SPI1STATH_RXELM4_LENGTH                 0x00000001

#define _SPI1STATH_RXELM5_POSITION               0x0000000D
#define _SPI1STATH_RXELM5_MASK                   0x00002000
#define _SPI1STATH_RXELM5_LENGTH                 0x00000001

#define _SPI1BUFL_SPI1BUFL_POSITION              0x00000000
#define _SPI1BUFL_SPI1BUFL_MASK                  0x0000FFFF
#define _SPI1BUFL_SPI1BUFL_LENGTH                0x00000010

#define _SPI1BUFL_DATA_POSITION                  0x00000000
#define _SPI1BUFL_DATA_MASK                      0x0000FFFF
#define _SPI1BUFL_DATA_LENGTH                    0x00000010

#define _SPI1BUFH_SPI1BUFH_POSITION              0x00000000
#define _SPI1BUFH_SPI1BUFH_MASK                  0x0000FFFF
#define _SPI1BUFH_SPI1BUFH_LENGTH                0x00000010

#define _SPI1BUFH_DATA_POSITION                  0x00000000
#define _SPI1BUFH_DATA_MASK                      0x0000FFFF
#define _SPI1BUFH_DATA_LENGTH                    0x00000010

#define _SPI1BRGL_SPI1BRGL_POSITION              0x00000000
#define _SPI1BRGL_SPI1BRGL_MASK                  0x00001FFF
#define _SPI1BRGL_SPI1BRGL_LENGTH                0x0000000D

#define _SPI1BRGL_BRG_POSITION                   0x00000000
#define _SPI1BRGL_BRG_MASK                       0x00001FFF
#define _SPI1BRGL_BRG_LENGTH                     0x0000000D

#define _SPI1IMSK1_SPIRBFEN_POSITION             0x00000000
#define _SPI1IMSK1_SPIRBFEN_MASK                 0x00000001
#define _SPI1IMSK1_SPIRBFEN_LENGTH               0x00000001

#define _SPI1IMSK1_SPITBFEN_POSITION             0x00000001
#define _SPI1IMSK1_SPITBFEN_MASK                 0x00000002
#define _SPI1IMSK1_SPITBFEN_LENGTH               0x00000001

#define _SPI1IMSK1_SPITBEN_POSITION              0x00000003
#define _SPI1IMSK1_SPITBEN_MASK                  0x00000008
#define _SPI1IMSK1_SPITBEN_LENGTH                0x00000001

#define _SPI1IMSK1_SPIRBEN_POSITION              0x00000005
#define _SPI1IMSK1_SPIRBEN_MASK                  0x00000020
#define _SPI1IMSK1_SPIRBEN_LENGTH                0x00000001

#define _SPI1IMSK1_SPIROVEN_POSITION             0x00000006
#define _SPI1IMSK1_SPIROVEN_MASK                 0x00000040
#define _SPI1IMSK1_SPIROVEN_LENGTH               0x00000001

#define _SPI1IMSK1_SRMTEN_POSITION               0x00000007
#define _SPI1IMSK1_SRMTEN_MASK                   0x00000080
#define _SPI1IMSK1_SRMTEN_LENGTH                 0x00000001

#define _SPI1IMSK1_SPITUREN_POSITION             0x00000008
#define _SPI1IMSK1_SPITUREN_MASK                 0x00000100
#define _SPI1IMSK1_SPITUREN_LENGTH               0x00000001

#define _SPI1IMSK1_BUSYEN_POSITION               0x0000000B
#define _SPI1IMSK1_BUSYEN_MASK                   0x00000800
#define _SPI1IMSK1_BUSYEN_LENGTH                 0x00000001

#define _SPI1IMSK1_FRMERREN_POSITION             0x0000000C
#define _SPI1IMSK1_FRMERREN_MASK                 0x00001000
#define _SPI1IMSK1_FRMERREN_LENGTH               0x00000001

#define _SPI1IMSKL_SPIRBFEN_POSITION             0x00000000
#define _SPI1IMSKL_SPIRBFEN_MASK                 0x00000001
#define _SPI1IMSKL_SPIRBFEN_LENGTH               0x00000001

#define _SPI1IMSKL_SPITBFEN_POSITION             0x00000001
#define _SPI1IMSKL_SPITBFEN_MASK                 0x00000002
#define _SPI1IMSKL_SPITBFEN_LENGTH               0x00000001

#define _SPI1IMSKL_SPITBEN_POSITION              0x00000003
#define _SPI1IMSKL_SPITBEN_MASK                  0x00000008
#define _SPI1IMSKL_SPITBEN_LENGTH                0x00000001

#define _SPI1IMSKL_SPIRBEN_POSITION              0x00000005
#define _SPI1IMSKL_SPIRBEN_MASK                  0x00000020
#define _SPI1IMSKL_SPIRBEN_LENGTH                0x00000001

#define _SPI1IMSKL_SPIROVEN_POSITION             0x00000006
#define _SPI1IMSKL_SPIROVEN_MASK                 0x00000040
#define _SPI1IMSKL_SPIROVEN_LENGTH               0x00000001

#define _SPI1IMSKL_SRMTEN_POSITION               0x00000007
#define _SPI1IMSKL_SRMTEN_MASK                   0x00000080
#define _SPI1IMSKL_SRMTEN_LENGTH                 0x00000001

#define _SPI1IMSKL_SPITUREN_POSITION             0x00000008
#define _SPI1IMSKL_SPITUREN_MASK                 0x00000100
#define _SPI1IMSKL_SPITUREN_LENGTH               0x00000001

#define _SPI1IMSKL_BUSYEN_POSITION               0x0000000B
#define _SPI1IMSKL_BUSYEN_MASK                   0x00000800
#define _SPI1IMSKL_BUSYEN_LENGTH                 0x00000001

#define _SPI1IMSKL_FRMERREN_POSITION             0x0000000C
#define _SPI1IMSKL_FRMERREN_MASK                 0x00001000
#define _SPI1IMSKL_FRMERREN_LENGTH               0x00000001

#define _SPI1IMSK2_TXMSK_POSITION                0x00000000
#define _SPI1IMSK2_TXMSK_MASK                    0x0000003F
#define _SPI1IMSK2_TXMSK_LENGTH                  0x00000006

#define _SPI1IMSK2_TXWIEN_POSITION               0x00000007
#define _SPI1IMSK2_TXWIEN_MASK                   0x00000080
#define _SPI1IMSK2_TXWIEN_LENGTH                 0x00000001

#define _SPI1IMSK2_RXMSK_POSITION                0x00000008
#define _SPI1IMSK2_RXMSK_MASK                    0x00003F00
#define _SPI1IMSK2_RXMSK_LENGTH                  0x00000006

