MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS806/mcu.h
#define _IEC1_U2TXIE_POSITION                    0x0000000F
#define _IEC1_U2TXIE_MASK                        0x00008000
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC2_SPI2TXIE_POSITION                  0x00000000
#define _IEC2_SPI2TXIE_MASK                      0x00000001
#define _IEC2_SPI2TXIE_LENGTH                    0x00000001

#define _IEC2_SPI2RXIE_POSITION                  0x00000001
#define _IEC2_SPI2RXIE_MASK                      0x00000002
#define _IEC2_SPI2RXIE_LENGTH                    0x00000001

#define _IEC2_C1RXIE_POSITION                    0x00000002
#define _IEC2_C1RXIE_MASK                        0x00000004
#define _IEC2_C1RXIE_LENGTH                      0x00000001

#define _IEC2_C1IE_POSITION                      0x00000003
#define _IEC2_C1IE_MASK                          0x00000008
#define _IEC2_C1IE_LENGTH                        0x00000001

#define _IEC2_DMA3IE_POSITION                    0x00000004
#define _IEC2_DMA3IE_MASK                        0x00000010
#define _IEC2_DMA3IE_LENGTH                      0x00000001

#define _IEC2_IC3IE_POSITION                     0x00000005
#define _IEC2_IC3IE_MASK                         0x00000020
#define _IEC2_IC3IE_LENGTH                       0x00000001

#define _IEC2_IC4IE_POSITION                     0x00000006
#define _IEC2_IC4IE_MASK                         0x00000040
#define _IEC2_IC4IE_LENGTH                       0x00000001

#define _IEC3_SI2C2IE_POSITION                   0x00000001
#define _IEC3_SI2C2IE_MASK                       0x00000002
#define _IEC3_SI2C2IE_LENGTH                     0x00000001

#define _IEC3_MI2C2IE_POSITION                   0x00000002
#define _IEC3_MI2C2IE_MASK                       0x00000004
#define _IEC3_MI2C2IE_LENGTH                     0x00000001

#define _IEC3_INT4IE_POSITION                    0x00000006
#define _IEC3_INT4IE_MASK                        0x00000040
#define _IEC3_INT4IE_LENGTH                      0x00000001

#define _IEC3_C2RXIE_POSITION                    0x00000007
#define _IEC3_C2RXIE_MASK                        0x00000080
#define _IEC3_C2RXIE_LENGTH                      0x00000001

#define _IEC3_C2IE_POSITION                      0x00000008
#define _IEC3_C2IE_MASK                          0x00000100
#define _IEC3_C2IE_LENGTH                        0x00000001

#define _IEC3_PSEMIE_POSITION                    0x00000009
#define _IEC3_PSEMIE_MASK                        0x00000200
#define _IEC3_PSEMIE_LENGTH                      0x00000001

#define _IEC4_U1EIE_POSITION                     0x00000001
#define _IEC4_U1EIE_MASK                         0x00000002
#define _IEC4_U1EIE_LENGTH                       0x00000001

#define _IEC4_U2EIE_POSITION                     0x00000002
#define _IEC4_U2EIE_MASK                         0x00000004
#define _IEC4_U2EIE_LENGTH                       0x00000001

#define _IEC4_C1TXIE_POSITION                    0x00000006
#define _IEC4_C1TXIE_MASK                        0x00000040
#define _IEC4_C1TXIE_LENGTH                      0x00000001

#define _IEC4_C2TXIE_POSITION                    0x00000007
#define _IEC4_C2TXIE_MASK                        0x00000080
#define _IEC4_C2TXIE_LENGTH                      0x00000001

#define _IEC4_PSESIE_POSITION                    0x00000009
#define _IEC4_PSESIE_MASK                        0x00000200
#define _IEC4_PSESIE_LENGTH                      0x00000001

#define _IEC5_SPI3TXIE_POSITION                  0x0000000A
#define _IEC5_SPI3TXIE_MASK                      0x00000400
#define _IEC5_SPI3TXIE_LENGTH                    0x00000001

#define _IEC5_SPI3RXIE_POSITION                  0x0000000B
#define _IEC5_SPI3RXIE_MASK                      0x00000800
#define _IEC5_SPI3RXIE_LENGTH                    0x00000001

#define _IEC5_PWM1IE_POSITION                    0x0000000E
#define _IEC5_PWM1IE_MASK                        0x00004000
#define _IEC5_PWM1IE_LENGTH                      0x00000001

#define _IEC5_PWM2IE_POSITION                    0x0000000F
#define _IEC5_PWM2IE_MASK                        0x00008000
#define _IEC5_PWM2IE_LENGTH                      0x00000001

#define _IEC6_PWM3IE_POSITION                    0x00000000
#define _IEC6_PWM3IE_MASK                        0x00000001
#define _IEC6_PWM3IE_LENGTH                      0x00000001

#define _IEC6_PWM4IE_POSITION                    0x00000001
#define _IEC6_PWM4IE_MASK                        0x00000002
#define _IEC6_PWM4IE_LENGTH                      0x00000001

#define _IEC6_PWM5IE_POSITION                    0x00000002
#define _IEC6_PWM5IE_MASK                        0x00000004
#define _IEC6_PWM5IE_LENGTH                      0x00000001

#define _IEC6_PWM6IE_POSITION                    0x00000003
#define _IEC6_PWM6IE_MASK                        0x00000008
#define _IEC6_PWM6IE_LENGTH                      0x00000001

#define _IEC6_PWM7IE_POSITION                    0x00000004
#define _IEC6_PWM7IE_MASK                        0x00000010
#define _IEC6_PWM7IE_LENGTH                      0x00000001

#define _IEC6_PWM8IE_POSITION                    0x00000005
#define _IEC6_PWM8IE_MASK                        0x00000020
#define _IEC6_PWM8IE_LENGTH                      0x00000001

#define _IEC6_AC2IE_POSITION                     0x00000007
#define _IEC6_AC2IE_MASK                         0x00000080
#define _IEC6_AC2IE_LENGTH                       0x00000001

#define _IEC6_AC3IE_POSITION                     0x00000008
#define _IEC6_AC3IE_MASK                         0x00000100
#define _IEC6_AC3IE_LENGTH                       0x00000001

#define _IEC6_AC4IE_POSITION                     0x00000009
#define _IEC6_AC4IE_MASK                         0x00000200
#define _IEC6_AC4IE_LENGTH                       0x00000001

#define _IEC6_ADCAN0IE_POSITION                  0x0000000E
#define _IEC6_ADCAN0IE_MASK                      0x00004000
#define _IEC6_ADCAN0IE_LENGTH                    0x00000001

#define _IEC6_ADCAN1IE_POSITION                  0x0000000F
#define _IEC6_ADCAN1IE_MASK                      0x00008000
#define _IEC6_ADCAN1IE_LENGTH                    0x00000001

#define _IEC7_ADCAN2IE_POSITION                  0x00000000
#define _IEC7_ADCAN2IE_MASK                      0x00000001
#define _IEC7_ADCAN2IE_LENGTH                    0x00000001

#define _IEC7_ADCAN3IE_POSITION                  0x00000001
#define _IEC7_ADCAN3IE_MASK                      0x00000002
#define _IEC7_ADCAN3IE_LENGTH                    0x00000001

#define _IEC7_ADCAN4IE_POSITION                  0x00000002
#define _IEC7_ADCAN4IE_MASK                      0x00000004
#define _IEC7_ADCAN4IE_LENGTH                    0x00000001

#define _IEC7_ADCAN5IE_POSITION                  0x00000003
#define _IEC7_ADCAN5IE_MASK                      0x00000008
#define _IEC7_ADCAN5IE_LENGTH                    0x00000001

#define _IEC7_ADCAN6IE_POSITION                  0x00000004
#define _IEC7_ADCAN6IE_MASK                      0x00000010
#define _IEC7_ADCAN6IE_LENGTH                    0x00000001

