MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS806/mcu.h
#define _IPC35_ICDIP0_POSITION                   0x00000008
#define _IPC35_ICDIP0_MASK                       0x00000100
#define _IPC35_ICDIP0_LENGTH                     0x00000001

#define _IPC35_ICDIP1_POSITION                   0x00000009
#define _IPC35_ICDIP1_MASK                       0x00000200
#define _IPC35_ICDIP1_LENGTH                     0x00000001

#define _IPC35_ICDIP2_POSITION                   0x0000000A
#define _IPC35_ICDIP2_MASK                       0x00000400
#define _IPC35_ICDIP2_LENGTH                     0x00000001

#define _IPC35_JTAGIP0_POSITION                  0x0000000C
#define _IPC35_JTAGIP0_MASK                      0x00001000
#define _IPC35_JTAGIP0_LENGTH                    0x00000001

#define _IPC35_JTAGIP1_POSITION                  0x0000000D
#define _IPC35_JTAGIP1_MASK                      0x00002000
#define _IPC35_JTAGIP1_LENGTH                    0x00000001

#define _IPC35_JTAGIP2_POSITION                  0x0000000E
#define _IPC35_JTAGIP2_MASK                      0x00004000
#define _IPC35_JTAGIP2_LENGTH                    0x00000001

#define _IPC36_PTGSTEPIP_POSITION                0x00000004
#define _IPC36_PTGSTEPIP_MASK                    0x00000070
#define _IPC36_PTGSTEPIP_LENGTH                  0x00000003

#define _IPC36_PTGWDTIP_POSITION                 0x00000008
#define _IPC36_PTGWDTIP_MASK                     0x00000700
#define _IPC36_PTGWDTIP_LENGTH                   0x00000003

#define _IPC36_PTG0IP_POSITION                   0x0000000C
#define _IPC36_PTG0IP_MASK                       0x00007000
#define _IPC36_PTG0IP_LENGTH                     0x00000003

#define _IPC36_PTGSTEP0_POSITION                 0x00000004
#define _IPC36_PTGSTEP0_MASK                     0x00000010
#define _IPC36_PTGSTEP0_LENGTH                   0x00000001

#define _IPC36_PTGSTEP1_POSITION                 0x00000005
#define _IPC36_PTGSTEP1_MASK                     0x00000020
#define _IPC36_PTGSTEP1_LENGTH                   0x00000001

#define _IPC36_PTGSTEP2_POSITION                 0x00000006
#define _IPC36_PTGSTEP2_MASK                     0x00000040
#define _IPC36_PTGSTEP2_LENGTH                   0x00000001

#define _IPC36_PTGWDTP0_POSITION                 0x00000008
#define _IPC36_PTGWDTP0_MASK                     0x00000100
#define _IPC36_PTGWDTP0_LENGTH                   0x00000001

#define _IPC36_PTGWDTP1_POSITION                 0x00000009
#define _IPC36_PTGWDTP1_MASK                     0x00000200
#define _IPC36_PTGWDTP1_LENGTH                   0x00000001

#define _IPC36_PTGWDTP2_POSITION                 0x0000000A
#define _IPC36_PTGWDTP2_MASK                     0x00000400
#define _IPC36_PTGWDTP2_LENGTH                   0x00000001

#define _IPC36_PTGP0_POSITION                    0x0000000C
#define _IPC36_PTGP0_MASK                        0x00001000
#define _IPC36_PTGP0_LENGTH                      0x00000001

#define _IPC36_PTG0P1_POSITION                   0x0000000D
#define _IPC36_PTG0P1_MASK                       0x00002000
#define _IPC36_PTG0P1_LENGTH                     0x00000001

#define _IPC36_PTG0P2_POSITION                   0x0000000E
#define _IPC36_PTG0P2_MASK                       0x00004000
#define _IPC36_PTG0P2_LENGTH                     0x00000001

#define _IPC37_PTG1IP_POSITION                   0x00000000
#define _IPC37_PTG1IP_MASK                       0x00000007
#define _IPC37_PTG1IP_LENGTH                     0x00000003

#define _IPC37_PTG2IP_POSITION                   0x00000004
#define _IPC37_PTG2IP_MASK                       0x00000070
#define _IPC37_PTG2IP_LENGTH                     0x00000003

#define _IPC37_PTG3IP_POSITION                   0x00000008
#define _IPC37_PTG3IP_MASK                       0x00000700
#define _IPC37_PTG3IP_LENGTH                     0x00000003

#define _IPC37_ADCAN8IP_POSITION                 0x0000000C
#define _IPC37_ADCAN8IP_MASK                     0x00007000
#define _IPC37_ADCAN8IP_LENGTH                   0x00000003

#define _IPC37_PTG1P0_POSITION                   0x00000000
#define _IPC37_PTG1P0_MASK                       0x00000001
#define _IPC37_PTG1P0_LENGTH                     0x00000001

#define _IPC37_PTG1P1_POSITION                   0x00000001
#define _IPC37_PTG1P1_MASK                       0x00000002
#define _IPC37_PTG1P1_LENGTH                     0x00000001

#define _IPC37_PTG1P2_POSITION                   0x00000002
#define _IPC37_PTG1P2_MASK                       0x00000004
#define _IPC37_PTG1P2_LENGTH                     0x00000001

#define _IPC37_PTG2P0_POSITION                   0x00000004
#define _IPC37_PTG2P0_MASK                       0x00000010
#define _IPC37_PTG2P0_LENGTH                     0x00000001

#define _IPC37_PTG2P1_POSITION                   0x00000005
#define _IPC37_PTG2P1_MASK                       0x00000020
#define _IPC37_PTG2P1_LENGTH                     0x00000001

#define _IPC37_PTG2P2_POSITION                   0x00000006
#define _IPC37_PTG2P2_MASK                       0x00000040
#define _IPC37_PTG2P2_LENGTH                     0x00000001

#define _IPC37_PTG3P0_POSITION                   0x00000008
#define _IPC37_PTG3P0_MASK                       0x00000100
#define _IPC37_PTG3P0_LENGTH                     0x00000001

#define _IPC37_PTG3P1_POSITION                   0x00000009
#define _IPC37_PTG3P1_MASK                       0x00000200
#define _IPC37_PTG3P1_LENGTH                     0x00000001

#define _IPC37_PTG3P2_POSITION                   0x0000000A
#define _IPC37_PTG3P2_MASK                       0x00000400
#define _IPC37_PTG3P2_LENGTH                     0x00000001

#define _IPC37_ADCAN8IP0_POSITION                0x0000000C
#define _IPC37_ADCAN8IP0_MASK                    0x00001000
#define _IPC37_ADCAN8IP0_LENGTH                  0x00000001

#define _IPC37_ADCAN8IP1_POSITION                0x0000000D
#define _IPC37_ADCAN8IP1_MASK                    0x00002000
#define _IPC37_ADCAN8IP1_LENGTH                  0x00000001

#define _IPC37_ADCAN8IP2_POSITION                0x0000000E
#define _IPC37_ADCAN8IP2_MASK                    0x00004000
#define _IPC37_ADCAN8IP2_LENGTH                  0x00000001

#define _IPC38_ADCAN9IP_POSITION                 0x00000000
#define _IPC38_ADCAN9IP_MASK                     0x00000007
#define _IPC38_ADCAN9IP_LENGTH                   0x00000003

