MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS806/mcu.h
#define _LEBDLY7_LEB3_POSITION                   0x00000006
#define _LEBDLY7_LEB3_MASK                       0x00000040
#define _LEBDLY7_LEB3_LENGTH                     0x00000001

#define _LEBDLY7_LEB4_POSITION                   0x00000007
#define _LEBDLY7_LEB4_MASK                       0x00000080
#define _LEBDLY7_LEB4_LENGTH                     0x00000001

#define _LEBDLY7_LEB5_POSITION                   0x00000008
#define _LEBDLY7_LEB5_MASK                       0x00000100
#define _LEBDLY7_LEB5_LENGTH                     0x00000001

#define _LEBDLY7_LEB6_POSITION                   0x00000009
#define _LEBDLY7_LEB6_MASK                       0x00000200
#define _LEBDLY7_LEB6_LENGTH                     0x00000001

#define _LEBDLY7_LEB7_POSITION                   0x0000000A
#define _LEBDLY7_LEB7_MASK                       0x00000400
#define _LEBDLY7_LEB7_LENGTH                     0x00000001

#define _LEBDLY7_LEB8_POSITION                   0x0000000B
#define _LEBDLY7_LEB8_MASK                       0x00000800
#define _LEBDLY7_LEB8_LENGTH                     0x00000001

#define _AUXCON7_CHOPLEN_POSITION                0x00000000
#define _AUXCON7_CHOPLEN_MASK                    0x00000001
#define _AUXCON7_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON7_CHOPHEN_POSITION                0x00000001
#define _AUXCON7_CHOPHEN_MASK                    0x00000002
#define _AUXCON7_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON7_CHOPSEL_POSITION                0x00000002
#define _AUXCON7_CHOPSEL_MASK                    0x0000003C
#define _AUXCON7_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON7_BLANKSEL_POSITION               0x00000008
#define _AUXCON7_BLANKSEL_MASK                   0x00000F00
#define _AUXCON7_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON7_HRDDIS_POSITION                 0x0000000E
#define _AUXCON7_HRDDIS_MASK                     0x00004000
#define _AUXCON7_HRDDIS_LENGTH                   0x00000001

#define _AUXCON7_HRPDIS_POSITION                 0x0000000F
#define _AUXCON7_HRPDIS_MASK                     0x00008000
#define _AUXCON7_HRPDIS_LENGTH                   0x00000001

#define _AUXCON7_CHOPSEL0_POSITION               0x00000002
#define _AUXCON7_CHOPSEL0_MASK                   0x00000004
#define _AUXCON7_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON7_CHOPSEL1_POSITION               0x00000003
#define _AUXCON7_CHOPSEL1_MASK                   0x00000008
#define _AUXCON7_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON7_CHOPSEL2_POSITION               0x00000004
#define _AUXCON7_CHOPSEL2_MASK                   0x00000010
#define _AUXCON7_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON7_CHOPSEL3_POSITION               0x00000005
#define _AUXCON7_CHOPSEL3_MASK                   0x00000020
#define _AUXCON7_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON7_BLANKSEL0_POSITION              0x00000008
#define _AUXCON7_BLANKSEL0_MASK                  0x00000100
#define _AUXCON7_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON7_BLANKSEL1_POSITION              0x00000009
#define _AUXCON7_BLANKSEL1_MASK                  0x00000200
#define _AUXCON7_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON7_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON7_BLANKSEL2_MASK                  0x00000400
#define _AUXCON7_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON7_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON7_BLANKSEL3_MASK                  0x00000800
#define _AUXCON7_BLANKSEL3_LENGTH                0x00000001

#define _PWMCON8_IUE_POSITION                    0x00000000
#define _PWMCON8_IUE_MASK                        0x00000001
#define _PWMCON8_IUE_LENGTH                      0x00000001

#define _PWMCON8_XPRES_POSITION                  0x00000001
#define _PWMCON8_XPRES_MASK                      0x00000002
#define _PWMCON8_XPRES_LENGTH                    0x00000001

#define _PWMCON8_CAM_POSITION                    0x00000002
#define _PWMCON8_CAM_MASK                        0x00000004
#define _PWMCON8_CAM_LENGTH                      0x00000001

#define _PWMCON8_MTBS_POSITION                   0x00000003
#define _PWMCON8_MTBS_MASK                       0x00000008
#define _PWMCON8_MTBS_LENGTH                     0x00000001

#define _PWMCON8_DTC_POSITION                    0x00000006
#define _PWMCON8_DTC_MASK                        0x000000C0
#define _PWMCON8_DTC_LENGTH                      0x00000002

#define _PWMCON8_MDCS_POSITION                   0x00000008
#define _PWMCON8_MDCS_MASK                       0x00000100
#define _PWMCON8_MDCS_LENGTH                     0x00000001

#define _PWMCON8_ITB_POSITION                    0x00000009
#define _PWMCON8_ITB_MASK                        0x00000200
#define _PWMCON8_ITB_LENGTH                      0x00000001

#define _PWMCON8_TRGIEN_POSITION                 0x0000000A
#define _PWMCON8_TRGIEN_MASK                     0x00000400
#define _PWMCON8_TRGIEN_LENGTH                   0x00000001

#define _PWMCON8_CLIEN_POSITION                  0x0000000B
#define _PWMCON8_CLIEN_MASK                      0x00000800
#define _PWMCON8_CLIEN_LENGTH                    0x00000001

#define _PWMCON8_FLTIEN_POSITION                 0x0000000C
#define _PWMCON8_FLTIEN_MASK                     0x00001000
#define _PWMCON8_FLTIEN_LENGTH                   0x00000001

#define _PWMCON8_TRGSTAT_POSITION                0x0000000D
#define _PWMCON8_TRGSTAT_MASK                    0x00002000
#define _PWMCON8_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON8_CLSTAT_POSITION                 0x0000000E
#define _PWMCON8_CLSTAT_MASK                     0x00004000
#define _PWMCON8_CLSTAT_LENGTH                   0x00000001

#define _PWMCON8_FLTSTAT_POSITION                0x0000000F
#define _PWMCON8_FLTSTAT_MASK                    0x00008000
#define _PWMCON8_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON8_DTC0_POSITION                   0x00000006
#define _PWMCON8_DTC0_MASK                       0x00000040
#define _PWMCON8_DTC0_LENGTH                     0x00000001

#define _PWMCON8_DTC1_POSITION                   0x00000007
#define _PWMCON8_DTC1_MASK                       0x00000080
#define _PWMCON8_DTC1_LENGTH                     0x00000001

#define _IOCON8_OSYNC_POSITION                   0x00000000
#define _IOCON8_OSYNC_MASK                       0x00000001
#define _IOCON8_OSYNC_LENGTH                     0x00000001

